Twist/Twist-TAS/servicerequestfiles/RTRActivation.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mys="http://mysimplemobile.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <mys:ActivatePhone>
         <partnerAuthentication>
            <partnerId>EPAY</partnerId>
            <securityCode>EPAY123</securityCode>
         </partnerAuthentication>
         <partnerReference>
            <referenceId>@RefNbr</referenceId>
         </partnerReference>
         <activationDeviceInfo>
            <mys:brand>@brand</mys:brand>
            <zip>@zip</zip>
          <sim>@sim</sim>
            <esn>@esn</esn>
         </activationDeviceInfo>
         <payments>
            <partnerPayment>
               <retailPaymentType>CreditCard</retailPaymentType>
               <amount>@amount</amount>
            </partnerPayment>
         </payments>
         <planCode>@planCode</planCode>
      </mys:ActivatePhone>
   </soapenv:Body>
</soapenv:Envelope>
